_posts/php/2015-03-20-php-timing-task.html
---
layout: post
title: PHP 定时任务
author: zrg
comments: false
description: PHP 定时任务实现
categories:
- php
tags:
- PHP-定时任务
photos:
---

<div id="outline-container-orge944b36" class="outline-2">
<h2 id="orge944b36">介绍</h2>
<div class="outline-text-2" id="text-orge944b36">
</div>
<div id="outline-container-org30f34ce" class="outline-3">
<h3 id="org30f34ce">PHP定时执行的三种方式实现</h3>
<div class="outline-text-3" id="text-org30f34ce">
<pre class="example">
1、windows 的计划任务 
2、linux的脚本程序
3、定时刷新Web浏览器
</pre>
</div>
</div>
<div id="outline-container-org429bdec" class="outline-3">
<h3 id="org429bdec">定时刷新Web浏览器</h3>
<div class="outline-text-3" id="text-org429bdec">
<pre class="example">
//首先解决以下几个问题：
1、PHP脚本执行时间限制，默认的是30m 解决办法：set_time_limit();或者修改PHP.ini 设置max_execution_time时间（不推荐）
2、如果客户端浏览器关闭，程序可能就被迫终止，解决办法：ignore_user_abort即使关闭页面依然正常执行
3、如果程序一直执行很有可能会消耗大量的资源，解决办法使用sleep使用程序休眠一会，然后在执行
</pre>


<pre class="example">
特别说明：由于定时刷新浏览器的方式效率不是很高，建议直接使用脚本方式。
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp">&lt;?php
ignore_user_abort()<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">//&#20851;&#25481;&#27983;&#35272;&#22120;&#65292;PHP&#33050;&#26412;&#20063;&#21487;&#20197;&#32487;&#32493;&#25191;&#34892;.</span>
set_time_limit(3000)<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">// &#36890;&#36807;set_time_limit(0)&#21487;&#20197;&#35753;&#31243;&#24207;&#26080;&#38480;&#21046;&#30340;&#25191;&#34892;&#19979;&#21435;</span>
$interval=5<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">// &#27599;&#38548;5s&#36816;&#34892;</span>
//&#26041;&#27861;1--&#27515;&#24490;&#29615;
do{
    echo '&#27979;&#35797;'.time().'&lt;br/&gt;'<span style="color: #727072;">; </span>
    sleep($interval)<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">// &#31561;&#24453;5s    </span>
}while(true)<span style="color: #727072;">;</span>

//&#26041;&#27861;2---sleep &#23450;&#26102;&#25191;&#34892;(&#25512;&#33616;)
require_once './curlClass.php'<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">//&#24341;&#20837;&#25991;&#20214;</span>
$curl = new httpCurl()<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">//&#23454;&#20363;&#21270;</span>
$stime = $curl-&gt;getmicrotime()<span style="color: #727072;">;</span>
for($i=0<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">$i&lt;=10;$i++){</span>
        echo '&#27979;&#35797;'.time().'&lt;br/&gt;'<span style="color: #727072;">; </span>
        sleep($interval)<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">// &#31561;&#24453;5s</span>
}
ob_flush()<span style="color: #727072;">;</span>
flush()<span style="color: #727072;">;</span>
$etime = $curl-&gt;getmicrotime()<span style="color: #727072;">;</span>
echo '&lt;hr&gt;'<span style="color: #727072;">;</span>
echo round(($etime-stime),4)<span style="color: #727072;">;</span><span style="color: #727072; font-style: italic;">//&#31243;&#24207;&#25191;&#34892;&#26102;&#38388;</span>
</pre>
</div>
</div>
</div>
</div>
